manual_run_3/manual_35_172.31.59.132_8g-hdf5.log
hostname=ip-172-31-59-132, be=0, 64-bit, os=Linux, arch=x86-64, fio=fio-3.19-44-g8dbd-dirty, flags=1
<ip-172-31-59-132> 8g-detector-write-split: (g=0): rw=write, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=posixaio, iodepth=4
<ip-172-31-59-132> 8g-detector-prelayout: (g=0): rw=read, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=posixaio, iodepth=4
<ip-172-31-59-132> ...
<ip-172-31-59-132> Starting 4 processes
<ip-172-31-59-132> 8g-detector-write-split: Laying out IO files (20 files / total 163840MiB)
<ip-172-31-59-132> 8g-detector-prelayout: Laying out IO files (20 files / total 163840MiB)
<ip-172-31-59-132> 
8g-detector-write-split: (groupid=0, jobs=4): err= 0: pid=14697: Sun Apr 19 22:58:50 2020
  Description  : ['detector write, separate workloads']
  read: IOPS=289, BW=1160MiB/s (1216MB/s)(223GiB/196460msec)
    slat (nsec): min=159, max=57391, avg=2755.31, stdev=4213.09
    clat (usec): min=633, max=3994.6k, avg=13574.88, stdev=54591.53
     lat (usec): min=634, max=3994.6k, avg=13577.64, stdev=54591.41
    clat percentiles (usec):
     |  1.00th=[    750],  5.00th=[    824], 10.00th=[    873],
     | 20.00th=[    971], 30.00th=[   2212], 40.00th=[   3752],
     | 50.00th=[   4015], 60.00th=[   4359], 70.00th=[   8455],
     | 80.00th=[  12387], 90.00th=[  32375], 95.00th=[  51643],
     | 99.00th=[ 160433], 99.50th=[ 250610], 99.90th=[ 421528],
     | 99.95th=[ 608175], 99.99th=[2298479]
   bw (  MiB/s): min=    7, max= 2688, per=100.00%, avg=1220.35, stdev=382.23, samples=373
   iops        : min=    1, max=  672, avg=305.09, stdev=95.56, samples=373
  write: IOPS=261, BW=1048MiB/s (1098MB/s)(18.6GiB/18176msec); 0 zone resets
    slat (usec): min=83, max=461, avg=226.23, stdev=55.25
    clat (usec): min=1543, max=11209, avg=6200.93, stdev=829.71
     lat (usec): min=1790, max=11449, avg=6427.14, stdev=831.54
    clat percentiles (usec):
     |  1.00th=[ 5538],  5.00th=[ 5669], 10.00th=[ 5735], 20.00th=[ 5866],
     | 30.00th=[ 5932], 40.00th=[ 5932], 50.00th=[ 5997], 60.00th=[ 6063],
     | 70.00th=[ 6194], 80.00th=[ 6325], 90.00th=[ 6521], 95.00th=[ 6980],
     | 99.00th=[10290], 99.50th=[10552], 99.90th=[10945], 99.95th=[10945],
     | 99.99th=[11207]
   bw (  MiB/s): min= 1192, max= 2624, per=100.00%, avg=2330.68, stdev=375.83, samples=16
   iops        : min=  298, max=  656, avg=582.62, stdev=93.93, samples=16
  lat (usec)   : 750=0.95%, 1000=19.25%
  lat (msec)   : 2=7.44%, 4=17.67%, 10=32.43%, 20=8.14%, 50=9.25%
  lat (msec)   : 100=3.30%, 250=1.10%, 500=0.40%, 750=0.03%, 1000=0.01%
  lat (msec)   : 2000=0.02%, >=2000=0.01%
  cpu          : usr=0.94%, sys=3.40%, ctx=60143, majf=0, minf=123
  IO depths    : 1=0.1%, 2=3.3%, 4=96.7%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=56966,4759,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=1160MiB/s (1216MB/s), 1160MiB/s-1160MiB/s (1216MB/s-1216MB/s), io=223GiB (239GB), run=196460-196460msec
  WRITE: bw=1048MiB/s (1098MB/s), 1048MiB/s-1048MiB/s (1098MB/s-1098MB/s), io=18.6GiB (19.0GB), run=18176-18176msec
### (35) done 172.31.59.132_8g-hdf5 ###### Sun Apr 19 22:58:50 UTC 2020 ###