manual_run_3/manual_36_172.31.62.220_4g-hdf5.log
hostname=ip-172-31-62-220, be=0, 64-bit, os=Linux, arch=x86-64, fio=fio-3.19-44-g8dbd-dirty, flags=1
<ip-172-31-62-220> 4g-detector-write-split: (g=0): rw=write, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=posixaio, iodepth=4
<ip-172-31-62-220> 4g-detector-prelayout: (g=0): rw=read, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=posixaio, iodepth=4
<ip-172-31-62-220> ...
<ip-172-31-62-220> Starting 4 processes
<ip-172-31-62-220> 
4g-detector-write-split: (groupid=0, jobs=4): err= 0: pid=20283: Sun Apr 19 22:58:50 2020
  Description  : ['detector write, separate workloads']
  read: IOPS=220, BW=881MiB/s (924MB/s)(283GiB/328977msec)
    slat (nsec): min=159, max=2568.5k, avg=3190.09, stdev=10339.40
    clat (usec): min=631, max=1712.2k, avg=17925.55, stdev=55647.42
     lat (usec): min=633, max=1712.2k, avg=17928.74, stdev=55647.38
    clat percentiles (usec):
     |  1.00th=[    742],  5.00th=[    824], 10.00th=[    898],
     | 20.00th=[   1123], 30.00th=[   3818], 40.00th=[   4113],
     | 50.00th=[   5342], 60.00th=[   9634], 70.00th=[  13042],
     | 80.00th=[  17695], 90.00th=[  32900], 95.00th=[  54264],
     | 99.00th=[ 250610], 99.50th=[ 396362], 99.90th=[ 725615],
     | 99.95th=[ 926942], 99.99th=[1535116]
   bw (  KiB/s): min= 8191, max=2605056, per=100.00%, avg=920506.78, stdev=531841.66, samples=644
   iops        : min=    1, max=  636, avg=224.73, stdev=129.84, samples=644
  write: IOPS=215, BW=861MiB/s (903MB/s)(131GiB/155515msec); 0 zone resets
    slat (usec): min=85, max=2159, avg=215.34, stdev=48.19
    clat (usec): min=1406, max=15900, avg=6090.31, stdev=538.52
     lat (usec): min=1540, max=16025, avg=6305.66, stdev=538.31
    clat percentiles (usec):
     |  1.00th=[ 5538],  5.00th=[ 5669], 10.00th=[ 5669], 20.00th=[ 5800],
     | 30.00th=[ 5866], 40.00th=[ 5932], 50.00th=[ 5997], 60.00th=[ 6063],
     | 70.00th=[ 6194], 80.00th=[ 6325], 90.00th=[ 6652], 95.00th=[ 6915],
     | 99.00th=[ 7767], 99.50th=[ 8291], 99.90th=[11076], 99.95th=[11731],
     | 99.99th=[13960]
   bw (  MiB/s): min=   56, max= 2704, per=100.00%, avg=1964.10, stdev=755.42, samples=136
   iops        : min=   14, max=  676, avg=491.02, stdev=188.85, samples=136
  lat (usec)   : 750=0.90%, 1000=10.26%
  lat (msec)   : 2=3.85%, 4=9.76%, 10=48.79%, 20=14.27%, 50=8.26%
  lat (msec)   : 100=2.29%, 250=0.93%, 500=0.48%, 750=0.14%, 1000=0.04%
  lat (msec)   : 2000=0.02%
  cpu          : usr=1.87%, sys=4.25%, ctx=114108, majf=0, minf=125
  IO depths    : 1=0.1%, 2=1.3%, 4=98.6%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=72442,33483,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=881MiB/s (924MB/s), 881MiB/s-881MiB/s (924MB/s-924MB/s), io=283GiB (304GB), run=328977-328977msec
  WRITE: bw=861MiB/s (903MB/s), 861MiB/s-861MiB/s (903MB/s-903MB/s), io=131GiB (140GB), run=155515-155515msec
### (36) done 172.31.62.220_4g-hdf5 ###### Sun Apr 19 22:58:50 UTC 2020 ###