manual_run_3/manual_37_172.31.63.204_8g-hdf5.log
hostname=ip-172-31-63-204, be=0, 64-bit, os=Linux, arch=x86-64, fio=fio-3.19-44-g8dbd-dirty, flags=1
<ip-172-31-63-204> 8g-detector-write-split: (g=0): rw=write, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=posixaio, iodepth=4
<ip-172-31-63-204> 8g-detector-prelayout: (g=0): rw=read, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=posixaio, iodepth=4
<ip-172-31-63-204> ...
<ip-172-31-63-204> Starting 4 processes
<ip-172-31-63-204> 
8g-detector-write-split: (groupid=0, jobs=4): err= 0: pid=17802: Sun Apr 19 22:58:49 2020
  Description  : ['detector write, separate workloads']
  read: IOPS=236, BW=945MiB/s (991MB/s)(249GiB/270004msec)
    slat (nsec): min=160, max=49935, avg=1244.11, stdev=2046.07
    clat (usec): min=582, max=5547.6k, avg=16739.73, stdev=81893.59
     lat (usec): min=583, max=5547.6k, avg=16740.97, stdev=81893.58
    clat percentiles (usec):
     |  1.00th=[    668],  5.00th=[    725], 10.00th=[    758],
     | 20.00th=[    832], 30.00th=[   2376], 40.00th=[   3490],
     | 50.00th=[   3720], 60.00th=[   4080], 70.00th=[   8291],
     | 80.00th=[  13304], 90.00th=[  35390], 95.00th=[  57934],
     | 99.00th=[ 254804], 99.50th=[ 371196], 99.90th=[ 683672],
     | 99.95th=[ 893387], 99.99th=[4932502]
   bw (  KiB/s): min= 8191, max=2531328, per=100.00%, avg=1033875.16, stdev=541613.71, samples=505
   iops        : min=    1, max=  618, avg=252.41, stdev=132.23, samples=505
  write: IOPS=245, BW=980MiB/s (1028MB/s)(88.0GiB/91936msec); 0 zone resets
    slat (usec): min=74, max=391, avg=204.98, stdev=42.72
    clat (usec): min=1320, max=82629, avg=5953.67, stdev=1505.45
     lat (usec): min=1515, max=82842, avg=6158.64, stdev=1505.82
    clat percentiles (usec):
     |  1.00th=[ 5211],  5.00th=[ 5342], 10.00th=[ 5407], 20.00th=[ 5473],
     | 30.00th=[ 5538], 40.00th=[ 5604], 50.00th=[ 5669], 60.00th=[ 5800],
     | 70.00th=[ 5932], 80.00th=[ 6063], 90.00th=[ 6456], 95.00th=[ 7701],
     | 99.00th=[ 9634], 99.50th=[11207], 99.90th=[15008], 99.95th=[22676],
     | 99.99th=[82314]
   bw (  MiB/s): min=  128, max= 2848, per=100.00%, avg=2324.30, stdev=616.01, samples=77
   iops        : min=   32, max=  712, avg=581.06, stdev=153.99, samples=77
  lat (usec)   : 750=6.48%, 1000=14.29%
  lat (msec)   : 2=1.37%, 4=21.25%, 10=38.97%, 20=6.04%, 50=6.90%
  lat (msec)   : 100=2.93%, 250=1.02%, 500=0.57%, 750=0.13%, 1000=0.03%
  lat (msec)   : 2000=0.01%, >=2000=0.02%
  cpu          : usr=1.45%, sys=2.63%, ctx=88196, majf=0, minf=122
  IO depths    : 1=0.1%, 2=0.4%, 4=99.6%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=63814,22527,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=945MiB/s (991MB/s), 945MiB/s-945MiB/s (991MB/s-991MB/s), io=249GiB (268GB), run=270004-270004msec
  WRITE: bw=980MiB/s (1028MB/s), 980MiB/s-980MiB/s (1028MB/s-1028MB/s), io=88.0GiB (94.5GB), run=91936-91936msec
### (37) done 172.31.63.204_8g-hdf5 ###### Sun Apr 19 22:58:49 UTC 2020 ###