manual_run_3/manual_38_172.31.54.192_1m-detector.log
hostname=ip-172-31-54-192, be=0, 64-bit, os=Linux, arch=x86-64, fio=fio-3.19-44-g8dbd-dirty, flags=1
<ip-172-31-54-192> 1m-detector-write-split: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=posixaio, iodepth=4
<ip-172-31-54-192> 1m-detector-prelayout: (g=0): rw=read, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=posixaio, iodepth=4
<ip-172-31-54-192> ...
<ip-172-31-54-192> Starting 4 processes
<ip-172-31-54-192> 1m-detector-write-split: Laying out IO files (5000 files / total 5000MiB)
<ip-172-31-54-192> 
1m-detector-write-split: (groupid=0, jobs=4): err= 0: pid=0: Sun Apr 19 22:58:48 2020
  Description  : ['detector write, separate workloads']
  read: IOPS=146, BW=146MiB/s (153MB/s)(20.6GiB/144370msec)
    slat (nsec): min=1007, max=31019, avg=4749.98, stdev=2150.35
    clat (usec): min=2184, max=52850, avg=5126.85, stdev=2660.99
     lat (usec): min=2188, max=52853, avg=5131.60, stdev=2660.97
    clat percentiles (usec):
     |  1.00th=[ 2671],  5.00th=[ 3032], 10.00th=[ 3261], 20.00th=[ 3621],
     | 30.00th=[ 3884], 40.00th=[ 4146], 50.00th=[ 4424], 60.00th=[ 4752],
     | 70.00th=[ 5211], 80.00th=[ 5932], 90.00th=[ 7373], 95.00th=[ 9634],
     | 99.00th=[16712], 99.50th=[19792], 99.90th=[28967], 99.95th=[33424],
     | 99.99th=[43779]
   bw (  KiB/s): min=77823, max=219136, per=100.00%, avg=149959.72, stdev=23388.97, samples=288
   iops        : min=   75, max=  214, avg=146.44, stdev=22.84, samples=288
  lat (msec)   : 4=34.16%, 10=61.25%, 20=4.13%, 50=0.45%, 100=0.01%
  cpu          : usr=0.51%, sys=2.26%, ctx=89760, majf=0, minf=131
  IO depths    : 1=98.4%, 2=0.7%, 4=0.9%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=21115,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=146MiB/s (153MB/s), 146MiB/s-146MiB/s (153MB/s-153MB/s), io=20.6GiB (22.1GB), run=144370-144370msec
### (38) done 172.31.54.192_1m-detector ###### Sun Apr 19 22:58:48 UTC 2020 ###