manual_run_3/manual_39_172.31.50.237_16m-detector.log
hostname=ip-172-31-50-237, be=0, 64-bit, os=Linux, arch=x86-64, fio=fio-3.19-44-g8dbd-dirty, flags=1
<ip-172-31-50-237> 16m-detector-write-split: (g=0): rw=write, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=posixaio, iodepth=4
<ip-172-31-50-237> 16m-detector-prelayout: (g=0): rw=read, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=posixaio, iodepth=4
<ip-172-31-50-237> ...
<ip-172-31-50-237> Starting 4 processes
<ip-172-31-50-237> 
16m-detector-write-split: (groupid=0, jobs=4): err= 0: pid=0: Sun Apr 19 22:58:48 2020
  Description  : ['detector write, separate workloads']
  read: IOPS=218, BW=872MiB/s (915MB/s)(111GiB/129829msec)
    slat (nsec): min=152, max=36816, avg=2211.14, stdev=2642.60
    clat (usec): min=582, max=60174, avg=8196.36, stdev=4899.28
     lat (usec): min=583, max=60178, avg=8198.57, stdev=4898.64
    clat percentiles (usec):
     |  1.00th=[ 1172],  5.00th=[ 1270], 10.00th=[ 1352], 20.00th=[ 3621],
     | 30.00th=[ 6849], 40.00th=[ 7570], 50.00th=[ 8094], 60.00th=[ 8717],
     | 70.00th=[ 9372], 80.00th=[10945], 90.00th=[13829], 95.00th=[16909],
     | 99.00th=[22938], 99.50th=[26608], 99.90th=[38011], 99.95th=[47973],
     | 99.99th=[56886]
   bw (  KiB/s): min=589823, max=1261568, per=100.00%, avg=894441.93, stdev=160002.71, samples=259
   iops        : min=  143, max=  308, avg=218.37, stdev=39.06, samples=259
  lat (usec)   : 750=0.13%, 1000=0.06%
  lat (msec)   : 2=16.55%, 4=3.74%, 10=54.50%, 20=22.86%, 50=2.11%
  lat (msec)   : 100=0.04%
  cpu          : usr=0.21%, sys=1.92%, ctx=56223, majf=0, minf=108
  IO depths    : 1=36.1%, 2=44.2%, 4=19.7%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=28315,0,0,0 short=0,0,0,0 dropped=0,0,0,0

Run status group 0 (all jobs):
   READ: bw=872MiB/s (915MB/s), 872MiB/s-872MiB/s (915MB/s-915MB/s), io=111GiB (119GB), run=129829-129829msec
### (39) done 172.31.50.237_16m-detector ###### Sun Apr 19 22:58:48 UTC 2020 ###